anysphere.cursorpyright
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.vscode-github-actions
gruntfuggly.todo-tree
humao.rest-client
ms-python.debugpy
ms-python.python
usernamehw.errorlens